eagletrt/chimera-bms/BMS_STM32F334k8/Src/main.c
		  cmd = (uint8_t *)malloc(CMD_LEN*sizeof(uint8_t));


		  cmd[0] = 0x00;
		  cmd[1] = 0x01;
		  cmd[2] = 0x3d;
		  cmd[3] = 0x6e;


		  cmd_index = 4;
		  for (uint8_t current_ic = total_ic; current_ic > 0; current_ic--)      		 // Executes for each ltc6811 in daisy chain, this loops starts with
		  {
		    // The last IC on the stack. The first configuration written is
		    // Received by the last IC in the daisy chain

		    for (uint8_t current_byte = 0; current_byte < BYTES_IN_REG; current_byte++)	 // Executes for each of the 6 bytes in the CFGR register
		    {
		      // Current_byte is the byte counter

		      cmd[cmd_index] = config[current_ic-1][current_byte];          			 // Adding the config data to the array to be sent
		      cmd_index = cmd_index + 1;
		    }

		    cfg_pec = (uint16_t)pec15(BYTES_IN_REG, &config[current_ic-1][0]);   	     // Calculating the PEC for each ICs configuration register data
		    cmd[cmd_index] = (uint8_t)(cfg_pec >> 8);
		    cmd[cmd_index + 1] = (uint8_t)cfg_pec;
		    cmd_index = cmd_index + 2;
		  }


		  wakeup_idle1();                                 								 // This will guarantee that the ltc6811 isoSPI port is awake.This command can be removed.

		  // Output_low(LTC6811_CS);
		  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
		  spi_write_array(CMD_LEN, cmd);

		  // Output_high(LTC6811_CS);
		  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);
		  free(cmd);
}

/*----- Scan i2c Addresses -----*/
uint8_t retrieveI2Cid(){

	uint8_t i;
	for(i=0; i<255; i++){

			if(HAL_I2C_IsDeviceReady(&hi2c1, i, 1, 10) == HAL_OK){
		    //HAL_GPIO_TogglePin(GPIOD,GPIO_PIN_12);
			break;
			}
			return i;
	}

}

/*----- SPI Read Function -----*/
uint8_t spi_read_byte(uint8_t tx_dat)
	{
	    uint8_t data;

	    if ( HAL_SPI_TransmitReceive(&hspi1, (uint8_t*)0xFF, (uint8_t*)&data, 1, HAL_MAX_DELAY) == HAL_OK )
	    {
	        return(data);
	    }
	    return(-1);
}

/*----- Data Lenght Counter -----*/
int osal_DataLength( char *pString ){
	  return (int)( strlen( pString ) );
}

uint16_t crc15Table[256] = {0x0,0xc599, 0xceab, 0xb32, 0xd8cf, 0x1d56, 0x1664, 0xd3fd, 0xf407, 0x319e, 0x3aac,
                            0xff35, 0x2cc8, 0xe951, 0xe263, 0x27fa, 0xad97, 0x680e, 0x633c, 0xa6a5, 0x7558, 0xb0c1,
                            0xbbf3, 0x7e6a, 0x5990, 0x9c09, 0x973b, 0x52a2, 0x815f, 0x44c6, 0x4ff4, 0x8a6d, 0x5b2e,
                            0x9eb7, 0x9585, 0x501c, 0x83e1, 0x4678, 0x4d4a, 0x88d3, 0xaf29, 0x6ab0, 0x6182, 0xa41b,
                            0x77e6, 0xb27f, 0xb94d, 0x7cd4, 0xf6b9, 0x3320, 0x3812, 0xfd8b, 0x2e76, 0xebef, 0xe0dd,
                            0x2544, 0x2be, 0xc727, 0xcc15, 0x98c, 0xda71, 0x1fe8, 0x14da, 0xd143, 0xf3c5, 0x365c,
                            0x3d6e, 0xf8f7,0x2b0a, 0xee93, 0xe5a1, 0x2038, 0x7c2, 0xc25b, 0xc969, 0xcf0, 0xdf0d,
                            0x1a94, 0x11a6, 0xd43f, 0x5e52, 0x9bcb, 0x90f9, 0x5560, 0x869d, 0x4304, 0x4836, 0x8daf,
                            0xaa55, 0x6fcc, 0x64fe, 0xa167, 0x729a, 0xb703, 0xbc31, 0x79a8, 0xa8eb, 0x6d72, 0x6640,
                            0xa3d9, 0x7024, 0xb5bd, 0xbe8f, 0x7b16, 0x5cec, 0x9975, 0x9247, 0x57de, 0x8423, 0x41ba,
                            0x4a88, 0x8f11, 0x57c, 0xc0e5, 0xcbd7, 0xe4e, 0xddb3, 0x182a, 0x1318, 0xd681, 0xf17b,
                            0x34e2, 0x3fd0, 0xfa49, 0x29b4, 0xec2d, 0xe71f, 0x2286, 0xa213, 0x678a, 0x6cb8, 0xa921,
                            0x7adc, 0xbf45, 0xb477, 0x71ee, 0x5614, 0x938d, 0x98bf, 0x5d26, 0x8edb, 0x4b42, 0x4070,
                            0x85e9, 0xf84, 0xca1d, 0xc12f, 0x4b6, 0xd74b, 0x12d2, 0x19e0, 0xdc79, 0xfb83, 0x3e1a, 0x3528,
                            0xf0b1, 0x234c, 0xe6d5, 0xede7, 0x287e, 0xf93d, 0x3ca4, 0x3796, 0xf20f, 0x21f2, 0xe46b, 0xef59,
                            0x2ac0, 0xd3a, 0xc8a3, 0xc391, 0x608, 0xd5f5, 0x106c, 0x1b5e, 0xdec7, 0x54aa, 0x9133, 0x9a01,
                            0x5f98, 0x8c65, 0x49fc, 0x42ce, 0x8757, 0xa0ad, 0x6534, 0x6e06, 0xab9f, 0x7862, 0xbdfb, 0xb6c9,
                            0x7350, 0x51d6, 0x944f, 0x9f7d, 0x5ae4, 0x8919, 0x4c80, 0x47b2, 0x822b, 0xa5d1, 0x6048, 0x6b7a,
                            0xaee3, 0x7d1e, 0xb887, 0xb3b5, 0x762c, 0xfc41, 0x39d8, 0x32ea, 0xf773, 0x248e, 0xe117, 0xea25,
                            0x2fbc, 0x846, 0xcddf, 0xc6ed, 0x374, 0xd089, 0x1510, 0x1e22, 0xdbbb, 0xaf8, 0xcf61, 0xc453,
                            0x1ca, 0xd237, 0x17ae, 0x1c9c, 0xd905, 0xfeff, 0x3b66, 0x3054, 0xf5cd, 0x2630, 0xe3a9, 0xe89b,
                            0x2d02, 0xa76f, 0x62f6, 0x69c4, 0xac5d, 0x7fa0, 0xba39, 0xb10b, 0x7492, 0x5368, 0x96f1, 0x9dc3,
                            0x585a, 0x8ba7, 0x4e3e, 0x450c, 0x8095
                            };

/*----- SPI Write Function (?) -----*/
void spi_write_read(uint8_t tx_Data[],	// Array of data to be written on SPI port
			        uint8_t tx_len, 	// Length of the tx data arry
			        uint8_t *rx_data,	// Input: array that will store the data read by the SPI port
			        uint8_t rx_len 		// Option: number of bytes to be read from the SPI port
			        ){
	for (uint8_t i = 0; i < tx_len; i++)
		  {
				// spi_write(tx_Data[i]);
				HAL_SPI_Transmit(&hspi1, (uint8_t*)&tx_Data[i], 1, 100);
		  }

	for (uint8_t i = 0; i < rx_len; i++)
		  {
	            HAL_SPI_TransmitReceive(&hspi1, (uint8_t*)0xFF, (uint8_t*)&rx_data[i], 1, 100);
		  }
}

uint16_t pec15(uint8_t len,uint8_t* data ){

    uint16_t remainder,address;
	remainder = 16;					// PEC seed
	for (int i = 0; i < len; i++)
		{
			address = ((remainder >> 7) ^ data[i]) & 0xff;//calculate PEC table address
			remainder = (remainder << 8 ) ^ crc15Table[address];
		}
    return (remainder*2);//The CRC15 has a 0 in the LSB so the final value must be multiplied by 2
}

void wakeup_idle1(){

    // output_low(LTC6811_CS);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
	spi_read_byte(0xff);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);

	//HAL_Delay(10);
}

void spi_write_array(uint8_t len, 		// Option: Number of bytes to be written on the SPI port
                     uint8_t data[] 	// Array of bytes to be written on the SPI port
			         )
	{
		uint8_t ret_val;
	    for ( int i = 0; i < len; i++ )
		    {
		        HAL_SPI_TransmitReceive(&hspi1, (uint8_t*)&data[i], &ret_val, 1, 100);
		    }
}

