eagletrt/chimera-bms/BMS_STM32F334k8/Src/main.c
void wakeup_sleep(){

	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
    // cs_low(GPIO_PIN_9);
    HAL_SPI_Transmit(&hspi1, 0xFF,1, 0xFF);
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);
    HAL_Delay(1);
}

/*----- Read the raw data from the ltc6811 cell voltage register -----*/
void ltc6804_rdcv_reg(uint8_t reg, 			// Determines which cell voltage register is read back
			          uint8_t total_ic, 	// The number of ICs in the
			          uint8_t data[] 		// An array of the unparsed cell codes
			          ){

	const uint8_t REG_LEN = 8; //number of bytes in each ICs register + 2 bytes for the PEC
	uint8_t cmd[4];
	uint16_t cmd_pec;

	if (reg == 1)     //1: RDCVA
	  {
	    cmd[1] = 0x04;
	    cmd[0] = 0x00;
	  }else if (reg == 2) //2: RDCVB
		{
		  cmd[1] = 0x06;
		  cmd[0] = 0x00;
		}else if (reg == 3) //3: RDCVC
		  {
		    cmd[1] = 0x08;
		    cmd[0] = 0x00;
		  }else if (reg == 4) //4: RDCVD
			{
			  cmd[1] = 0x0A;
			  cmd[0] = 0x00;
			}else if (reg == 5) //4: RDCVE
			  {
			    cmd[1] = 0x09;
			    cmd[0] = 0x00;
			  }else if (reg == 6) //4: RDCVF
				{
				  cmd[1] = 0x0B;
				  cmd[0] = 0x00;
				}


	cmd_pec = pec15(2, cmd);
	cmd[2] = (uint8_t)(cmd_pec >> 8);
	cmd[3] = (uint8_t)(cmd_pec);

	wakeup_idle1(); //This will guarantee that the ltc6811 isoSPI port is awake. This command can be removed.
    // output_low(LTC6811_CS);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
	//uint8_t myData[8] = {1, 1, 1, 1, 1, 1, 1, 1};
	spi_write_read(cmd,4,data,8);
	//HAL_SPI_TransmitReceive(&hspi1,cmd,data,8,100);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);
	// output_high(LTC6811_CS);
}

void ltc6804_adcv(uint8_t MD, 		//!< ADC Conversion Mode
                  uint8_t DCP, 		//!< Controls if Discharge is permitted during conversion
                  uint8_t CH 		//!< Sets which Cell channels are converted
			      ){

	uint8_t cmd[4];
	uint16_t cmd_pec;
	uint8_t md_bits;

	md_bits = (MD & 0x02) >> 1;
	cmd[0] = md_bits + 0x02;
	md_bits = (MD & 0x01) << 7;
	cmd[1] =  md_bits + 0x60 + (DCP<<4) + CH;
	cmd_pec = pec15(2, cmd);

	cmd[2] = (uint8_t)(cmd_pec >> 8);
    cmd[3] = (uint8_t)(cmd_pec);

    wakeup_idle1();
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
	spi_write_array(4, cmd);
	//HAL_SPI_Transmit(&hspi1, cmd, 4,10);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);
}

void ltc6804_rdaux_reg(uint8_t reg, 		// Determines which GPIO voltage register is read back
                       uint8_t total_ic, 	// The number of ICs in the system
                       uint8_t *data 		// Array of the unparsed auxiliary codes
			           ){

	const uint8_t REG_LEN = 8; // number of bytes in the register + 2 bytes for the PEC
	uint8_t cmd[4];
	uint16_t cmd_pec;

	if (reg == 1)     //Read back auxiliary group A
	  {
	    cmd[1] = 0x0C;
	    cmd[0] = 0x00;
	  }else if (reg == 2)  //Read back auxiliary group B
		{
		  cmd[1] = 0x0e;
		  cmd[0] = 0x00;
		}else if (reg == 3)  //Read back auxiliary group B
		  {
		    cmd[1] = 0x0D;
		    cmd[0] = 0x00;
		  }else if (reg == 4)  //Read back auxiliary group B
			{
			  cmd[1] = 0x0F;
			  cmd[0] = 0x00;
			}else          //Read back auxiliary group A
			  {
			    cmd[1] = 0x0C;
			    cmd[0] = 0x00;
			  }

	cmd_pec = pec15(2, cmd);
	cmd[2] = (uint8_t)(cmd_pec >> 8);
	cmd[3] = (uint8_t)(cmd_pec);

	wakeup_idle1(); // This will guarantee that the ltc6811 isoSPI port is awake, this command can be removed.

    // Output_low(LTC6811_CS);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
	spi_write_read(cmd,4,data,(REG_LEN*total_ic));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);
	// Output_high(LTC6811_CS);
}

uint32_t ltc6804_pollAdc(){

	uint32_t counter = 0;
	uint8_t finished = 0;
	uint8_t current_time = 0;
	uint8_t cmd[4];
	uint16_t cmd_pec;

	cmd[0] = 0x07;
	cmd[1] = 0x14;
	cmd_pec = pec15(2, cmd);
	cmd[2] = (uint8_t)(cmd_pec >> 8);
	cmd[3] = (uint8_t)(cmd_pec);

	wakeup_idle1(); //This will guarantee that the ltc6811 isoSPI port is awake. This command can be removed.

	// Output_low(LTC6811_CS);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
	spi_write_array(4,cmd);

	while ((counter<200000)&&(finished == 0)){
	  uint8_t rx;
      // Current_time= HAL_SPI_Receive(&hspi1,rx,0xFF,100);
	  current_time= spi_read_byte(0xFF);
	  if (current_time>0){
		finished = 1;
	  }else{
		counter = counter + 10;
	  }
    }

	// Output_high(LTC6811_CS);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);

    return(counter);
}


/*!  Write the ltc6811 Sctrl register
This command will write the pwm registers of the ltc6811-1s
connected in a daisy chain stack. The pwm is written in descending
order so the last device's pwm is written first.
The function will calculate the needed PEC codes for the write data
and then transmit data to the ICs on a daisy chain.
Command Code:
-------------
|               |                           CMD[0]                              |                            CMD[1]                             |
|---------------|---------------------------------------------------------------|---------------------------------------------------------------|
|CMD[0:1]       |  15   |  14   |  13   |  12   |  11   |  10   |   9   |   8   |   7   |   6   |   5   |   4   |   3   |   2   |   1   |   0   |
|---------------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|
|WRSCTRL:         |   0   |   0   |   0   |   0   |   0   |   0   |   0   |   0   |   0   |   0   |   0   |   1   |   0   |   1   |   0   |   0   |
*/
void ltc6811_wrsctrl(uint8_t nIC,           //!< number of ICs in the daisy chain
                     uint8_t sctrl_reg,
                     uint8_t sctrl[][6]
                     ){ //0b00010100

	uint8_t cmd[12];
	uint16_t cmd_pec;
	uint16_t cmd_pec1;
	//uint8_t md_bits;

	//md_bits = (MD & 0x02) >> 1;
	//cmd[0] = md_bits + 0x02;
	cmd[0]=0x00;
	//md_bits = (MD & 0x01) << 7;
	//cmd[1] =  md_bits + 0x60 + (DCP<<4) + CH;
	cmd[1]=0b00010100;

	cmd_pec = pec15(2, cmd);
	cmd[2] = (uint8_t)(cmd_pec >> 8);
	cmd[3] = (uint8_t)(cmd_pec);
	cmd[4]= 0b00010001;
	cmd[5]= 0b00010001;
	cmd[6]= 0b00010001;
	cmd[7]= 0b10010001;
	cmd[8]= 0b00010001;
	cmd[9]= 0b00011001;
	cmd_pec1 = pec15(2, cmd);
	cmd[10] = (uint8_t)(cmd_pec1 >> 8);
	cmd[11] = (uint8_t)(cmd_pec1);
	wakeup_idle1();
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
	spi_write_array(12, cmd);
	//HAL_SPI_Transmit(&hspi1, cmd, 4,10);
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);
}

