eagletrt/chimera-bms/BMS_STM32F334k8/Src/main.c
/*!  Reads sctrl registers of a ltc6811 daisy chain
uint8_t r_sctrl[][8] is a two dimensional array that the function stores the read pwm data. The sctrl data for each IC
is stored in blocks of 8 bytes with the pwm data of the lowest IC on the stack in the first 8 bytes
block of the array, the second IC in the second 8 byte etc. Below is an table illustrating the array organization:
@return int8_t, PEC Status.
0: Data read back has matching PEC
-1: Data read back has incorrect PEC
Command Code:
-------------
|CMD[0:1]   |  15   |  14   |  13   |  12   |  11   |  10   |   9   |   8   |   7   |   6   |   5   |   4   |   3   |   2   |   1   |   0   |
|-----------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|-------|
|rdsctrl:   |   0   |   0   |   0   |   0   |   0   |   0   |   0   |   0   |   0   |   0   |   0   |   1   |   0   |   1   |   1   |   0   |
*/
uint8_t ltc6811_rdsctrl(uint8_t nIC, 			//!< number of ICs in the daisy chain
                        uint8_t sctrl_reg,
                        uint8_t r_sctrl[][8]    //!< a two dimensional array that the function stores the read pwm data
			                      ){

	uint8_t cmd[12];
	uint8_t cmd_pec;
	uint16_t cmd_pec1;
	uint8_t* d;
	//uint8_t md_bits;

	for(int i=0;i<nIC;i++){
	  //md_bits = (MD & 0x02) >> 1;
	  //cmd[0] = md_bits + 0x02;
	  cmd[0]=0x00;
	  //md_bits = (MD & 0x01) << 7;
	  //cmd[1] =  md_bits + 0x60 + (DCP<<4) + CH;
	  cmd[1]=0b00010110;

	  cmd_pec = pec15(2, cmd);
      cmd[2] = (uint8_t)(cmd_pec >> 8);
	  cmd[3] = (uint8_t)(cmd_pec);

	  cmd[4]= 0b00010001;
	  cmd[5]= 0b00010001;
      cmd[6]= 0b00010001;
	  cmd[7]= 0b10010001;
	  cmd[8]= 0b00010001;
	  cmd[9]= 0b00011001;
      cmd_pec1 = pec15(2, cmd);

	  cmd[10] = (uint8_t)(cmd_pec1 >> 8);
	  cmd[11] = (uint8_t)(cmd_pec1);

	  uint8_t* r;

      HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_RESET);
      spi_write_read(cmd,12,r,12);      //  DA CONTROLLARE CON PCB
	  d[i]=r;
	  //HAL_SPI_Transmit(&hspi1, cmd, 4,10);
	  HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, GPIO_PIN_SET);
	}
}

/*!  Start Sctrl data communication
This command will start the sctrl pulse communication over the spins
*/
void LTC6811_stsctrl(){

}



  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_CAN_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */

  /* SETTING CAN */
  sFilter.FilterMode = CAN_FILTERMODE_IDMASK;
  sFilter.FilterMode = CAN_FILTERMODE_IDMASK;
  sFilter.FilterIdLow = 0;
  sFilter.FilterIdHigh = 0;
  sFilter.FilterMaskIdHigh = 0;
  sFilter.FilterMaskIdLow = 0;
  sFilter.FilterFIFOAssignment = CAN_FILTER_FIFO0;
  sFilter.BankNumber = 0;
  sFilter.FilterScale = CAN_FILTERSCALE_16BIT;
  sFilter.FilterActivation = ENABLE;
  HAL_CAN_ConfigFilter(&hcan, &sFilter);

  HAL_CAN_Init(&hcan);

  int TOT_IC=12;
  int CELL_CH=9;

  uint8_t NUM_RX_BYT = 8;
  uint8_t BYT_IN_REG = 6;
  uint8_t CELL_IN_REG = 3;
  uint8_t NUM_CV_REG = 3;
  uint8_t cell_data[8];
  uint16_t cell_codes[TOT_IC][CELL_CH];
  uint16_t parsed_cell;
  uint16_t received_pec;
  uint16_t data_pec;
  uint8_t pec_error=0;

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {

  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */


  	  uint8_t TxData[8];
  	  TxData[0] = 1;
  	  TxData[1] = 2;
  	  TxData[2] = 3;
  	  TxData[3] = 4;
  	  TxData[4] = 5;
  	  TxData[5] = 6;
  	  TxData[6] = 7;
  	  TxData[7] = 8;
  	  //SICCOME NON FUNZIONA --> CAN_Send(0x64, TxData, 8);
  	  /*int idsave;
  	  uint8_t RxData[8];
  	  idsave = CAN_Receive(RxData, 8);
  	  */

  	  //SEND
  	  	HAL_StatusTypeDef status;

  		CanTxMsgTypeDef TxMess;
  		TxMess.StdId = 0x600 + 1; // 0x600 + Node ID
  		TxMess.DLC = 0x0;
  		TxMess.IDE = CAN_ID_STD;
  		TxMess.RTR = 0;
  		hcan.pTxMsg = &TxMess;
  		status = HAL_CAN_Transmit(&hcan, 1000);
  	  //Receive
  		CanRxMsgTypeDef RxMess;
  		RxMess.FIFONumber = CAN_FIFO1;
		RxMess.FMI = 14;
		RxMess.StdId =  0x580 + 1; // 0x580 + Node ID
		RxMess.DLC = 0;
		RxMess.RTR = 0;
		RxMess.IDE = CAN_ID_STD;
		hcan.pRxMsg = &RxMess;
		status = HAL_CAN_Receive(&hcan, CAN_FIFO1, 100);

		HAL_Delay(1000);




	 //wakeup_idle1();
	 ltc6804_adcv(MD_7KHZ_3KHZ, DCP_DISABLED, CELL_CH_ALL);
	 ltc6804_pollAdc();
	 //HAL_Delay(3);
	 //wakeup_idle1();

	 for(uint8_t cell_reg = 1; cell_reg<NUM_CV_REG+1; cell_reg++){                  // Executes once for each of the ltc6811 cell voltage registers

		 uint8_t data_counter = 0;
	     ltc6804_rdcv_reg(cell_reg, TOT_IC, cell_data);

	     for(uint8_t current_ic = 0 ; current_ic < TOT_IC; current_ic++){

	    	 //Current_ic is used as the IC counter
	 		 //Loops once for each of the 3 cell voltage codes in the register

	 		 for(uint8_t current_cell = 0; current_cell < 3; current_cell++) {

	 			 //Loops once for each of the 3 cell voltage codes in the register
	 		   	 //Each cell code is received as two bytes and is combined to
	 		   	 uint16_t parsed_cell = cell_data[data_counter]+(cell_reg-1)+ (cell_data[data_counter + 1] << 8);
	 		   	 //Because cell voltage codes are two bytes the data counter
	 		   	 cell_codes[current_cell][current_cell  + ((cell_reg - 1) * CELL_IN_REG)] = parsed_cell;
	 		   	 //valori in V
	 		   	 data_counter = data_counter + 2;
	 		   	 uint8_t num[9];
	 		   	 sprintf(num, "%d - ", parsed_cell);
	 		   	 HAL_UART_Transmit(&huart2, &num, strlen(num), 100);
	 		   	 HAL_Delay(100);
	 		 }

	 		 received_pec = (cell_data[data_counter] << 8) + cell_data[data_counter + 1];
	 		 data_pec = pec15(BYT_IN_REG, &cell_data[current_ic * NUM_RX_BYT]);
	 		 if(received_pec != data_pec){
	 			 pec_error = -1;
	 		 }

	 		 data_counter = data_counter + 2;
	 		 HAL_UART_Transmit(&huart2, "\r\n", 2, 100);
	     }
	 }
 }

  /* USER CODE END 3 */
}


/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

